{
  "project": "Coloring Book Generator",
  "branchName": "ralph/coloring-book-v1",
  "description": "Web app that converts uploaded family photos into age-appropriate coloring book pages using OpenAI",
  "userStories": [
    {
      "id": "US-001",
      "title": "Photo upload UI with drag-and-drop",
      "description": "As a parent, I want to upload a family photo so it can be turned into a coloring page.",
      "acceptanceCriteria": [
        "Drag-and-drop zone with click-to-browse fallback",
        "Accepts jpg, png, webp images",
        "Shows thumbnail preview of uploaded photo",
        "Photo is held in browser memory only — never sent to server for storage",
        "Can remove/replace the photo before generating",
        "Uses shadcn Card component for the upload area",
        "npm run build passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Age selector with complexity mapping",
      "description": "As a parent, I want to specify my child's age so the coloring page complexity is appropriate.",
      "acceptanceCriteria": [
        "Slider input for age 1-12 using shadcn Slider component",
        "Displays current age and complexity label (Simple/Medium/Detailed)",
        "Age 1-4: Simple (large shapes, thick lines, few elements)",
        "Age 5-7: Medium (moderate detail, some small elements)",
        "Age 8-12: Detailed (fine lines, complex scenes, many elements)",
        "Default age is 3",
        "npm run build passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "OpenAI API route for coloring page generation",
      "description": "As a developer, I need an API route that takes a photo and age, analyzes the photo with GPT-4o vision, and generates a B&W coloring page with appropriate complexity.",
      "acceptanceCriteria": [
        "POST /api/generate accepts base64 photo + age number",
        "Calls GPT-4o vision to describe the photo's subjects and scene",
        "Builds image generation prompt with age-appropriate complexity instructions",
        "Calls OpenAI image generation (gpt-image-1 or dall-e-3) requesting B&W line art coloring page",
        "Returns generated image as base64",
        "Handles errors gracefully with meaningful error messages",
        "Uses OPENAI_API_KEY from environment variables",
        "npm run build passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "The photo should NOT be stored anywhere. Process in memory and discard."
    },
    {
      "id": "US-004",
      "title": "Results display with loading state",
      "description": "As a parent, I want to see the generated coloring page with a nice loading experience.",
      "acceptanceCriteria": [
        "Generate button triggers API call with uploaded photo + selected age",
        "Shows shadcn Skeleton loading state while generating",
        "Displays generated coloring page image when ready",
        "Shows error message if generation fails",
        "Generate button is disabled when no photo is uploaded",
        "npm run build passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Download coloring page as PNG",
      "description": "As a parent, I want to download the coloring page as a PNG image.",
      "acceptanceCriteria": [
        "Download PNG button appears after generation completes",
        "Downloads the coloring page as a PNG file",
        "Filename includes a descriptive name like 'coloring-page.png'",
        "Uses shadcn Button component",
        "npm run build passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Export coloring pages as PDF",
      "description": "As a parent, I want to export coloring pages as a PDF so I can print them easily.",
      "acceptanceCriteria": [
        "Export PDF button appears after at least one coloring page is generated",
        "Uses jsPDF to create a PDF client-side",
        "Each coloring page is a full page in the PDF (letter size, landscape or portrait depending on image)",
        "Downloads automatically with filename like 'coloring-book.pdf'",
        "npm run build passes",
        "Verify in browser via Playwright MCP: export button visible, PDF downloads correctly"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Generate multiple coloring pages from one photo",
      "description": "As a parent, I want to generate several different coloring page variations from a single photo.",
      "acceptanceCriteria": [
        "Option to generate additional pages from the same photo",
        "Each generation creates a different style/interpretation",
        "All generated pages displayed in a grid",
        "Can select which pages to include in PDF export",
        "npm run build passes",
        "Verify in browser via Playwright MCP: grid layout renders, multiple pages display correctly"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Vary the prompt slightly each time to get different interpretations."
    },
    {
      "id": "US-008",
      "title": "Polish UI — slick minimal design",
      "description": "As a user, I want the app to look polished and professional.",
      "acceptanceCriteria": [
        "Clean layout with good whitespace and visual hierarchy",
        "Dark/light mode toggle using shadcn theming",
        "Subtle transitions and animations (loading, hover states)",
        "Mobile-responsive layout that works on phone and tablet",
        "App title and brief instructions at the top",
        "Consistent use of shadcn/ui components throughout",
        "npm run build passes",
        "Verify in browser via Playwright MCP: full user flow works, dark/light mode toggles, responsive layout on mobile viewport"
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Full QA pass via Playwright MCP",
      "description": "As a developer, I want to verify the entire app works end-to-end in the browser before calling this complete.",
      "acceptanceCriteria": [
        "Start dev server (npm run dev) and open http://localhost:3000 via Playwright MCP",
        "Verify the page loads with title, instructions, upload area, and age slider visible",
        "Upload a test image (use Playwright to attach a file) and confirm thumbnail preview appears",
        "Adjust the age slider and confirm the complexity label updates (Simple/Medium/Detailed)",
        "Click Generate and confirm loading skeleton appears",
        "After generation completes, confirm the coloring page image is displayed",
        "Click Download PNG and confirm the download triggers",
        "Generate a second coloring page and confirm both appear in a grid",
        "Click Export PDF and confirm the download triggers",
        "Toggle dark/light mode and confirm the theme switches correctly",
        "Resize viewport to mobile width (375px) and confirm layout is responsive",
        "Take screenshots at each step and log results in progress.txt",
        "Fix any bugs found during this QA pass before marking complete",
        "npm run build passes after any fixes"
      ],
      "priority": 9,
      "passes": true,
      "notes": "This is a QA-only story. Use Playwright MCP for all browser interactions. If the OpenAI API call takes too long or fails due to no real API key, verify everything up to the Generate button click and note the API dependency."
    },
    {
      "id": "US-010",
      "title": "Use original image as reference for coloring page generation",
      "description": "As a parent, I want the coloring page to closely match my uploaded photo's composition and details, not just a text summary of it.",
      "acceptanceCriteria": [
        "Pass the original uploaded image directly to gpt-image-1 as a reference image (via the `image` parameter)",
        "Keep the GPT-4o vision description as supplementary context in the prompt",
        "Generated coloring pages should visually match the composition, poses, and key details of the original photo",
        "npm run build passes",
        "Verify in browser via Playwright MCP: upload test image, generate coloring page, confirm output more closely resembles the original photo"
      ],
      "priority": 10,
      "passes": true,
      "notes": "Currently the pipeline loses detail by converting the photo to a 2-3 sentence text description before generating. Passing the image directly as a reference to gpt-image-1 preserves composition and details."
    },
    {
      "id": "US-011",
      "title": "Fix position of remove-image button on upload preview",
      "description": "As a user, I want the red X button that removes the uploaded image to be positioned flush in the top-right corner of the preview area.",
      "acceptanceCriteria": [
        "The remove-image button is positioned at the top-right corner of the image preview container",
        "npm run build passes",
        "Verify in browser via Playwright MCP: upload an image and confirm the X button sits in the top-right corner"
      ],
      "priority": 11,
      "passes": true,
      "notes": "Currently the X button appears weirdly positioned — it should be pinned to the top-right of the preview with appropriate padding so it looks natural."
    },
    {
      "id": "US-012",
      "title": "Fix uneven padding in age selector box",
      "description": "As a user, I want the age selector card to have uniform padding on all sides so it looks visually balanced.",
      "acceptanceCriteria": [
        "Check current padding values on the age selector Card component",
        "Ensure padding is uniform on all four sides (top, right, bottom, left)",
        "npm run build passes",
        "Verify in browser via Playwright MCP: age selector box has even spacing around its content"
      ],
      "priority": 12,
      "passes": true,
      "notes": "There appears to be too much padding at the top of the age selector box compared to the other sides."
    },
    {
      "id": "US-013",
      "title": "Fix loading skeleton to match actual generated content",
      "description": "As a user, I want the loading skeleton shown during image generation to accurately preview the shape of the content that will appear, so the transition feels seamless.",
      "acceptanceCriteria": [
        "Review the current loading skeleton layout and compare it to the actual generated result",
        "The skeleton should match the structure of what actually renders (likely just an image, no header)",
        "Remove any skeleton elements that don't correspond to real content (e.g. a header bar)",
        "npm run build passes",
        "Verify in browser via Playwright MCP: trigger generation and confirm the skeleton closely matches the final content layout"
      ],
      "priority": 13,
      "passes": false,
      "notes": "The current skeleton appears to show a header element plus an image placeholder, but the actual result is just an image. The skeleton should reflect the real content structure."
    },
    {
      "id": "US-014",
      "title": "Fix dark/light mode toggle responsiveness",
      "description": "As a user, I want the dark/light mode toggle to take effect immediately on the first click and every subsequent click.",
      "acceptanceCriteria": [
        "Verify the theme toggle applies the new theme immediately on the very first click after page load",
        "Verify subsequent toggles also apply immediately with no delay",
        "If there is a flash or delay on first toggle, investigate and fix the root cause (e.g. missing initial theme class, hydration mismatch)",
        "npm run build passes",
        "Verify in browser via Playwright MCP: load the page fresh, click the toggle, and confirm the theme changes instantly on the first and subsequent clicks"
      ],
      "priority": 14,
      "passes": false,
      "notes": "The toggle may not apply on the first click — possibly a hydration issue or missing initial theme state. Needs investigation."
    }
  ]
}
